Revit 2026 API

# LinearDimensionCreate Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static LinearDimension Create(
	Document document,
	View dbView,
	Line line,
	IList<Reference> references
)
```
```vb
Public Shared Function Create (
	document As Document,
	dbView As View,
	line As Line,
	references As IList(Of Reference)
) As LinearDimension
```
```cpp
public:
static LinearDimension^ Create(
	Document^ document,
	View^ dbView,
	Line^ line,
	IList<Reference^>^ references
)
```
```fsharp
static member Create :
        document : Document *
        dbView : View *
        line : Line *
        references : IList<Reference> -> LinearDimension
```

#### Parameters

document Document

dbView View

line Line

references IListReference

#### Return Value

LinearDimension

#### Reference

LinearDimension Class

Autodesk.Revit.DB Namespace